#في بايثون، المتغيرات والثوابت هما نوعان من النوعات في البرمجة. المتغيرات هي الأسماء التي تعبر عن القيم التي يمكن تغييرها، بينما الثوابت هي القيم التي لا يمكن تغييرها.

#متغيرات:

#المتغيرات هي الأسماء التي تعبر عن القيم التي يمكن تغييرها.
#يمكن تعريف المتغيرات باستخدام الكلمة الرئيسية var أو let أو const في بعض الحالات.
#يمكن تغيير قيمة المتغيرات في أي وقت.
#مثال: x = 5، في هذه الحالة، x هي متغير و5 هي قيمته.
#ثوابت:

#الثوابت هي القيم التي لا يمكن تغييرها.
#الثوابت تعريفها باستخدام الكلمة الرئيسية const.
#لا يمكن تغيير قيمة الثوابت بعد تعريفها.
#مثال: PI = 3.14، في هذه الحالة، PI هي ثابت و3.14 هي قيمته.
#فرق بين المتغيرات والثوابت:

#المتغيرات يمكن تغيير قيمتها في أي وقت، بينما الثوابت لا يمكن تغيير قيمتها بعد تعريفها.
#المتغيرات تعريفها باستخدام الكلمة الرئيسية var أو let أو const في بعض الحالات، بينما الثوابت تعريفها باستخدام الكلمة الرئيسية const.
#المتغيرات يمكن استخدامها في أي مكان في البرنامج، بينما الثوابت يمكن استخدامها فقط في مكان واحد في البرنامج.

#python


x = 5  # المتغير x تعريف
x = 10  # قيمة المتغير x تغيرت

PI = 3.14  # الثابت PI تعريف
# PI = 3.15  # لا يمكن تغيير قيمة الثابت PI
#في هذا المثال، x هي متغير و5 و10 هما قيمته. بينما PI هو ثابت و3.14 هي قيمته، و3.15 لا يمكن استخدامها كقيمة لPI بعد تعريفها.