#يمكن الوصول إلى المتغيرات العالمية عبر البرنامج بأكمله، بينما يمكن الوصول إلى المتغيرات المحلية فقط داخل الوظيفة أو الكتلة التي تم الإعلان عنها فيها

x = 5  # متغير عالمي

def القسمة(y):
    x_local = 10  # متغير محلي
    print("x_local:", x_local)
    print("x_global:", x)

print("Before calling القسمة:")
print("x_global:", x)

القسمة(2)

print("After calling القسمة:")
print("x_global:", x)

#في هذا البرنامج  المتغير x هو متغير عالمي ويمكن الوصول اليه من داخل الدالة (القسمه).  المتغير (x_local) هو متغير محلي ويمكن الوصول اليه فقط داخل الدالة (القسمه).