#في بايثون، هناك أنواع بيانات أساسية مثل:

# (int): هي أنواع البيانات التي يمكن أن تتمثل بأرقام صحيحة، مثل 5، -3، 0، 123، وغيرها.
#النصوص (str): هي أنواع البيانات التي يمكن أن تتمثل بالنصوص، مثل "hello"، 'hello'، "hello world"، وغيرها.
#الحروف (float): هي أنواع البيانات التي يمكن أن تتمثل بالاعداد العشرية، مثل 3.14، -0.5، 0.0، وغيرها.
#الحروف (complex): هي أنواع البيانات التي يمكن أن تتمثل بالاعداد المعقدة، مثل 3 + 4j، -5 - 6j، وغيرها.

# تعريف متغيرات
x = 5  # المعطيات (int)
y = "hello"  # النصوص (str)
z = 3.14  # الحروف (float)
w = 3 + 4j  # الحروف (complex)

# طباعة قيم المتغيرات
print(x)
print(y)
print(z)
print(w)